<a href="https://colab.research.google.com/github/Praveenpadidapu/ML-Assignments/blob/main/Assignment2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

 Create a Pandas DataFrame from the following dictionary:
data = {
'Name': ['Alice', 'Bob', 'Carol'],
'Age': [24, 27, 22],
'Salary': [50000, 55000, 48000]
}
• Add a new column called Bonus which is 10% of the salary.

In [ ]:
import pandas as pd
import numpy as np
data={ 'Name': ['Alice', 'Bob', 'Carol'], 'Age': [24, 27, 22], 'Salary': [50000, 55000, 48000]}
df1=pd.DataFrame(data)
print(df1)
#adding bonus column
print("after addition of column")
df1=df1.assign(Bonus=df1['Salary']*0.10)
df1['Bonus']=df1['Salary']/10
print(df1)

    Name  Age  Salary
0  Alice   24   50000
1    Bob   27   55000
2  Carol   22   48000
after addition of column
    Name  Age  Salary   Bonus
0  Alice   24   50000  5000.0
1    Bob   27   55000  5500.0
2  Carol   22   48000  4800.0

data = {
'Name': ['Alice', 'Bob', 'Carol'],
'Age': [24, 27, 22],
'Salary': [50000, 55000, 48000]
}
Display the first two rows.

In [ ]:
import pandas as pd
import numpy as np
data={ 'Name': ['Alice', 'Bob', 'Carol'], 'Age': [24, 27, 22], 'Salary': [50000, 55000, 48000]}
df1=pd.DataFrame(data)
print(df1)
#first two rows
print("first two rows")
print(df1.head(2))

    Name  Age  Salary
0  Alice   24   50000
1    Bob   27   55000
2  Carol   22   48000
first two rows
    Name  Age  Salary
0  Alice   24   50000
1    Bob   27   55000

data = { 'Name': ['Alice', 'Bob', 'Carol'], 'Age': [24, 27, 22], 'Salary': [50000, 55000, 48000] }
Compute the mean salary.

In [15]:
import pandas as pd
import numpy as np
data={ 'Name': ['Alice', 'Bob', 'Carol'], 'Age': [24, 27, 22], 'Salary': [50000, 55000, 48000]}
df1=pd.DataFrame(data)
print(df1)
#mean of salary
print("mean of salary",df1['Salary'].mean())

    Name  Age  Salary
0  Alice   24   50000
1    Bob   27   55000
2  Carol   22   48000
51000.0

 Extract all rows where the Age is greater than 25.

In [ ]:
import pandas as pd
import numpy as np
data={ 'Name': ['Alice', 'Bob', 'Carol'], 'Age': [24, 27, 22], 'Salary': [50000, 55000, 48000]}
df1=pd.DataFrame(data)
print(df1)
# rows greater than 25
print("rows greater than 25")
print(df1[df1['Age']>25])

Filter out rows where the Salary is less than 50000.

In [19]:
import pandas as pd
import numpy as np
data={ 'Name': ['Alice', 'Bob', 'Carol'], 'Age': [24, 27, 22], 'Salary': [50000, 55000, 48000]}
df1=pd.DataFrame(data)
print(df1)
print("after filtering")
print(df1[df1['Salary']>50000])

    Name  Age  Salary
0  Alice   24   50000
1    Bob   27   55000
2  Carol   22   48000
after filtering
  Name  Age  Salary
1  Bob   27   55000

data = {
'A': [1, 2, None, 4],
'B': [None, 2, 3, None],
'C': [1, 2, 3, 4]
}
df = pd.DataFrame(data)
• Fill missing values in column A with the mean of the column.

In [26]:
import pandas as pd
data={ 'A': [1, 2, None, 4], 'B': [None, 2, 3, None], 'C': [1, 2, 3, 4] }
df1=pd.DataFrame(data)
print(df1)
print("mean of A")
mean=df1['A'].mean()
print(mean)
df1['A'].fillna(mean,inplace=True)
print(df1)

     A    B  C
0  1.0  NaN  1
1  2.0  2.0  2
2  NaN  3.0  3
3  4.0  NaN  4
mean of A
2.3333333333333335
          A    B  C
0  1.000000  NaN  1
1  2.000000  2.0  2
2  2.333333  3.0  3
3  4.000000  NaN  4

<ipython-input-26-9b055db1d9b0>:8: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df1['A'].fillna(mean,inplace=True)

Drop rows where all values are None.

In [28]:
import pandas as pd
data={ 'A': [1, 2, None, 4], 'B': [None, 2, 3, None], 'C': [1, 2, 3, 4] }
df1=pd.DataFrame(data)
print(df1)
df1.dropna(how='all',inplace=True)
print(df1)

     A    B  C
0  1.0  NaN  1
1  2.0  2.0  2
2  NaN  3.0  3
3  4.0  NaN  4
     A    B  C
0  1.0  NaN  1
1  2.0  2.0  2
2  NaN  3.0  3
3  4.0  NaN  4

 Create a DataFrame for employees:
data = {
'Department': ['HR', 'HR', 'IT', 'IT', 'Finance'],
'Employee': ['Alice', 'Bob', 'Carol', 'David', 'Eve'],
'Salary': [50000, 45000, 60000, 65000, 70000]
}
• Group the data by Department and compute the total and mean salary for each
department.

In [ ]:
import pandas as pd
data= { 'Department': ['HR', 'HR', 'IT', 'IT', 'Finance'], 'Employee': ['Alice', 'Bob', 'Carol', 'David', 'Eve'], 'Salary': [50000, 45000, 60000, 65000, 70000] }
df1=pd.DataFrame(data)

#print(df1)
#groupby(df1['Department'])
print(df1.groupby('Department').agg({'Salary':['mean']}))
df1.rename(columns={'mean':'mean salary'})
#print(df1)

df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Carol']})
df2 = pd.DataFrame({'ID': [2, 3, 4], 'Age': [25, 30, 22]})
• Perform an inner join on the ID column.

In [40]:
import pandas as pd
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Carol']})
print(df1)
df2 = pd.DataFrame({'ID': [2, 3, 4], 'Age': [25, 30, 22]})
print(df2)
print("inner join")
print(pd.merge(df1,df2,on='ID',how='inner'))

   ID   Name
0   1  Alice
1   2    Bob
2   3  Carol
   ID  Age
0   2   25
1   3   30
2   4   22
inner join
   ID   Name  Age
0   2    Bob   25
1   3  Carol   30

 Given a small dataset, clean and display basic statistics using Pandas.

In [41]:
import pandas as pd
data={ 'A': [1, 2, None, 4], 'B': [None, 2, 3, None], 'C': [1, 2, 3, 4] }
df1=pd.DataFrame(data)
print(df1)

     A    B  C
0  1.0  NaN  1
1  2.0  2.0  2
2  NaN  3.0  3
3  4.0  NaN  4